---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PathFailures.Path3dRegenError
source: html/a8f401a4-ca7c-9fe7-328a-d06df76e3ef5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathFailures.Path3dRegenError Property

Picked Path could not be regenerated.

## Syntax (C#)
```csharp
public static FailureDefinitionId Path3dRegenError { get; }
```